Catalogs/Валюты.xml
<?xml version="1.0" encoding="UTF-8"?>
<MetaDataObject version="2.13">
	<Catalog>
		<Properties>
			<Name>Валюты</Name>
			<ObjectBelonging>Adopted</ObjectBelonging>
		</Properties>
		<ChildObjects>
			<Attribute>
				<Properties>
					<Name>БНБ_КотироватьКБолгарскомуЛеву</Name>
					<Comment>Если этот реквизит установлен в Истина, для валюты допускается загрузка курсов по отношению к болгарскому леву</Comment>
					<Type>
						<v8:Type>xs:boolean</v8:Type>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>СпособУстановкиКурса</Name>
					<ObjectBelonging>Adopted</ObjectBelonging>
					<Type>
						<v8:Type>cfg:EnumRef.СпособыУстановкиКурсаВалюты</v8:Type>
					</Type>
				</Properties>
			</Attribute>
		</ChildObjects>
	</Catalog>
</MetaDataObject>

Enums/СпособыУстановкиКурсаВалюты.xml
<?xml version="1.0" encoding="UTF-8"?>
<MetaDataObject version="2.13">
	<Enum>
		<Properties>
			<Name>СпособыУстановкиКурсаВалюты</Name>
			<ObjectBelonging>Adopted</ObjectBelonging>
		</Properties>
		<ChildObjects>
			<EnumValue>
				<Properties>
					<Name>НаценкаНаКурсДругойВалюты</Name>
					<ObjectBelonging>Adopted</ObjectBelonging>
				</Properties>
			</EnumValue>
			<EnumValue>
				<Properties>
					<Name>РучнойВвод</Name>
					<ObjectBelonging>Adopted</ObjectBelonging>
				</Properties>
			</EnumValue>
			<EnumValue>
				<Properties>
					<Name>ЗагрузкаИзИнтернета</Name>
					<ObjectBelonging>Adopted</ObjectBelonging>
				</Properties>
			</EnumValue>
			<EnumValue>
				<Properties>
					<Name>РасчетПоФормуле</Name>
					<ObjectBelonging>Adopted</ObjectBelonging>
				</Properties>
			</EnumValue>
		</ChildObjects>
	</Enum>
</MetaDataObject>

Catalogs/Валюты/Forms/ФормаЭлемента/Ext/Form/Module.bsl
&НаКлиенте
Процедура БНБ_ВалютаКотируетсяКЛевуПриИзмененииПеред(Элемент)
	БНБ_УстановитьДоступностьЭлементовФормы();	
КонецПроцедуры

&НаКлиенте
Процедура БНБ_ПриОткрытииПеред(Отказ)
	БНБ_УстановитьДоступностьЭлементовФормы();
КонецПроцедуры

&НаКлиенте
Процедура БНБ_УстановитьДоступностьЭлементовФормы() 
	
	ЭтаФорма.Элементы.ГруппаСпособУстановкиКурса.Доступность = НЕ Объект.БНБ_КотироватьКБолгарскомуЛеву;

КонецПроцедуры

&НаСервере
Процедура БНБ_ПередЗаписьюНаСервереПеред(Отказ, ТекущийОбъект, ПараметрыЗаписи)
	Если ТекущийОбъект.БНБ_КотироватьКБолгарскомуЛеву Тогда
		ТекущийОбъект.СпособУстановкиКурса = Перечисления.СпособыУстановкиКурсаВалюты.РучнойВвод; 
	КонецЕсли;
КонецПроцедуры
